---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DetailFailures.NeedsTwoToAlignEaves
source: html/1655ec14-830d-0f11-66bb-df38d5994e9e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DetailFailures.NeedsTwoToAlignEaves Property

At least two Slope Defining Lines are needed to perform Align Eaves.

## Syntax (C#)
```csharp
public static FailureDefinitionId NeedsTwoToAlignEaves { get; }
```